MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512ZVMB10/mcu.h
#define EACD                          0x7FFF80000000      // Error access control detail
#define EMN                           0x00000780      // Error master number
#define EATTR                         0x00000038      // Error attributes
#define ERW                           0x00000001      // Error read/write


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD0 register.
//
//*****************************************************************************

#define SRTADDR                       0x3FFFFFF80000000      // Start address


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD1 register.
//
//*****************************************************************************

#define ENDADDR                       0x3FFFFFF80000000      // End address


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD2 register.
//
//*****************************************************************************

#define M7RE                          0x80000000      // Bus master 7 read enable
#define M7WE                          0x40000000      // Bus master 7 write enable
#define M6RE                          0x20000000      // Bus master 6 read enable
#define M6WE                          0x10000000      // Bus master 6 write enable
#define M5RE                          0x08000000      // Bus master 5 read enable
#define M5WE                          0x04000000      // Bus master 5 write enable
#define M4RE                          0x02000000      // Bus master 4 read enable
#define M4WE                          0x01000000      // Bus master 4 write enable
#define M3SM                          0x00C00000      // Bus master 3 supervisor mode access control
#define M3UM                          0x00700000      // Bus master 3 user mode access control
#define M2SM                          0x00030000      // Bus master 2 supervisor mode access control
#define M2UM                          0x0001C000      // Bus master 2 user mode access control
#define M1SM                          0x00000C00      // Bus master 1 supervisor mode access control
#define M1UM                          0x00000700      // Bus master 1 user mode access control
#define M0SM                          0x00000030      // Bus master 0 supervisor mode access control
#define M0UM                          0x0000001C      // Bus master 0 user mode access control


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD3 register.
//
//*****************************************************************************

#define VLD                           0x00000001      // Valid


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDAACn register.
//
//*****************************************************************************

#define M7RE                          0x80000000      // Bus master 7 read enable
#define M7WE                          0x40000000      // Bus master 7 write enable
#define M6RE                          0x20000000      // Bus master 6 read enable
#define M6WE                          0x10000000      // Bus master 6 write enable
#define M5RE                          0x08000000      // Bus master 5 read enable
#define M5WE                          0x04000000      // Bus master 5 write enable
#define M4RE                          0x02000000      // Bus master 4 read enable
#define M4WE                          0x01000000      // Bus master 4 write enable
#define M3SM                          0x00C00000      // Bus master 3 supervisor mode access control
#define M3UM                          0x00700000      // Bus master 3 user mode access control
#define M2SM                          0x00030000      // Bus master 2 supervisor mode access control
#define M2UM                          0x0001C000      // Bus master 2 user mode access control
#define M1SM                          0x00000C00      // Bus master 1 supervisor mode access control
#define M1UM                          0x00000700      // Bus master 1 user mode access control
#define M0SM                          0x00000030      // Bus master 0 supervisor mode access control
#define M0UM                          0x0000001C      // Bus master 0 user mode access control


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_MPRA register.
//
//*****************************************************************************

#define MTR0                          0x40000000      // Master trusted for read
#define MTW0                          0x20000000      // Master trusted for writes
#define MPL0                          0x10000000      // Master privilege level
#define MTR1                          0x04000000      // Master trusted for read
#define MTW1                          0x02000000      // Master trusted for writes
#define MPL1                          0x01000000      // Master privilege level
#define MTR2                          0x00400000      // Master trusted for read
#define MTW2                          0x00200000      // Master trusted for writes
#define MPL2                          0x00100000      // Master privilege level
#define MTR3                          0x00040000      // Master trusted for read
#define MTW3                          0x00020000      // Master trusted for writes
#define MPL3                          0x00010000      // Master privilege level
#define MTR4                          0x00004000      // Master trusted for read
#define MTW4                          0x00002000      // Master trusted for writes
#define MPL4                          0x00001000      // Master privilege level
#define MTR5                          0x00000400      // Master trusted for read
#define MTW5                          0x00000200      // Master trusted for writes
#define MPL5                          0x00000100      // Master privilege level


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_PACRn register.
//
//*****************************************************************************

