MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512ZVMB10/mcu.h
#define PTCO                          0x7FFFFFFF80000000      // Port Clear Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PTOR register.
//
//*****************************************************************************

#define PTTO                          0x7FFFFFFF80000000      // Port Toggle Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDIR register.
//
//*****************************************************************************

#define PDI                           0x7FFFFFFF80000000      // Port Data Input


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDDR register.
//
//*****************************************************************************

#define PDD                           0x7FFFFFFF80000000      // Port Data Direction


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_GENCS register.
//
//*****************************************************************************

#define LPCLKS                        0x10000000      // Low Power Mode Clock Source Selection
#define LPSCNITV                      0x78000000      // TSI Low Power Mode Scan Interval
#define NSCN                          0x0F800000      // Number of Consecutive Scans per Electrode
#define PS                            0x001C0000      // Electrode oscillator prescaler
#define EOSF                          0x00008000      // End of scan flag
#define OUTRGF                        0x00004000      // Out of Range Flag
#define EXTERF                        0x00002000      // External electrode error occurred
#define OVRF                          0x00001000      // Overrun error flag
#define SCNIP                         0x00000200      // Scan-in-progress status
#define SWTS                          0x00000100      // Software trigger start
#define TSIEN                         0x00000080      // TSI module enable
#define TSIIE                         0x00000040      // TSI interrupt enable
#define ERIE                          0x00000020      // TSI error interrupt Enable
#define ESOR                          0x00000010      // End-of-scan or out-of-range interrupt select
#define STM                           0x00000002      // Scan trigger mode
#define STPE                          0x00000001      // TSI stop enable while in low-power modes (STOP, VLPS, LLS, and VLLS{3,2,1})


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_SCANC register.
//
//*****************************************************************************

#define REFCHRG                       0xF80000000      // Reference oscillator charge current select
#define CAPTRM                        0x1C000000      // Internal capacitance trim value
#define EXTCHRG                       0x0F800000      // External oscillator charge current select
#define DELVOL                        0x001C0000      // Delta voltage select applied to analog oscillators
#define SMOD                          0x007F8000      // Scan modulo
#define AMCLKDIV                      0x00000020      // Active mode clock divider
#define AMCLKS                        0x00000030      // Active mode clock source
#define AMPSC                         0x0000001C      // Active mode prescaler


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_PEN register.
//
//*****************************************************************************

#define LPSP                          0x00780000      // Low-power scan pin
#define PEN15                         0x00008000      // TSI pin 15 enable
#define PEN14                         0x00004000      // TSI pin 14 enable
#define PEN13                         0x00002000      // TSI pin 13 enable
#define PEN12                         0x00001000      // TSI pin 12 enable
#define PEN11                         0x00000800      // TSI pin 11 enable
#define PEN10                         0x00000400      // TSI pin 10 enable
#define PEN9                          0x00000200      // TSI pin 9 enable
#define PEN8                          0x00000100      // TSI pin 8 enable
#define PEN7                          0x00000080      // TSI pin 7 enable
#define PEN6                          0x00000040      // TSI pin 6 enable
#define PEN5                          0x00000020      // TSI pin 5 enable
#define PEN4                          0x00000010      // TSI pin 4 enable
#define PEN3                          0x00000008      // TSI pin 3 enable
#define PEN2                          0x00000004      // TSI pin 2 enable
#define PEN1                          0x00000002      // TSI pin 1 enable
#define PEN0                          0x00000001      // TSI pin 0 enable


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_STATUS register.
//
//*****************************************************************************

#define ERROF15-ERROF0                0x7FFF80000000      // TouchSensing Error Flag 15-0
#define ORNGF15-ORNGF0                0x7FFF8000      // Touch Sensing Electrode Out-of-Range Flag 15-0


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_CNTRn register.
//
//*****************************************************************************

#define CTN                           0x7FFF80000000      // TouchSensing channel n counter value
#define CTN1                          0x7FFF8000      // TouchSensing channel n-1 counter value


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_THRESHLDn register.
//
//*****************************************************************************

#define LTHH                          0x7FFF80000000      // Low threshold value
#define HTHH                          0x7FFF8000      // High threshold value ::


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1 register.
//
//*****************************************************************************

#define MS                            0x00400000      // EzPort chip select pin state
#define OSC32KSEL                     0x00080000      // 32K oscillator clock select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT2 register.
//
//*****************************************************************************

#define SDHCSRC                       0x60000000      // SDHC clock source select
#define I2SSRC                        0x06000000      // I2S master clock source select
#define PLLFLLSEL                     0x00010000      // PLL/FLL clock select
#define TRACECLKSEL                   0x00001000      // Debug trace clock select
#define CMTUARTPAD                    0x00000800      // CMT/UART pad drive strength
#define FBSL                          0x00000600      // FlexBus security level
#define MCGCLKSEL                     0x00000001      // MCG clock select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT4 register.
//
//*****************************************************************************

